#pip робота із плагінами які можна знайти на pypi

#pip istall установка

#pip list показа всіх установлених плагінів

#pip search пошук плагіну

#pip show  інформація про плагін

#pip uninstall видаленя плагіну
 

#!
try:
    # Блок, в якому розміщений підозрілий код
    num1 = int(input("Введіть перше число: "))
    num2 = int(input("Введіть друге число: "))
    result = num1 / num2
    print("Результат: ", result)
except ValueError:
    # Обробка помилки, якщо введені дані не можуть бути конвертовані у ціле число
    print("Помилка: Введені дані не є числами")
except ZeroDivisionError:
    # Обробка помилки, якщо введено число 0 як знаменник
    print("Помилка: Ділення на нуль неможливе")
except Exception as e:
    # Обробка будь-яких інших винятків, які не були включені до попередніх блоків except
    print("Сталася помилка:", str(e))
#2
import sqlite3

try:
    conn = sqlite3.connect("database.db")  # Встановлення з'єднання з базою даних
    cursor = conn.cursor()
    cursor.execute("SELECT * FROM users")  # Виконання запиту до бази даних
    rows = cursor.fetchall()  # Отримання результатів запиту
    for row in rows:
        print(row)
    conn.close()  # Закриття з'єднання з базою даних
except sqlite3.DatabaseError:
    print("Помилка: Помилка бази даних")
except Exception as e:
    print("Сталася помилка:", str(e))

#1
#Даний код використовує конструкцію try-except для обробки помилок, які можуть виникнути під час виконання певних операцій. 
#Основна ідея полягає в тому, що код, який може викликати виняток, розміщений в блоку try, а обробка винятків реалізована в блоках except.
#2
#Даний код використовує конструкцію try-except для обробки помилок, пов'язаних з роботою з базою даних SQLite. 
#Основна мета цього коду полягає в виконанні запиту до бази даних та виведенні результатів.


#Віртуальне середовище (Virtual Environment) - це інструмент, який дозволяє створювати ізольоване середовище для розробки та виконання програм. 
#Воно дозволяє встановлювати та керувати окремими версіями пакетів та залежностей для кожного проекту, що дозволяє уникнути конфліктів та проблем, пов'язаних зі сумісністю версій пакетів.

#python -m venv myenv твореня його


#myenv\Scripts\activate.bat активація

#pip install package_name всатановка плагіну

#pip list показ всіх плагінів 

#deactivate виход з нього


